#### SetShearModulus Method

---

|  |
| --- |
| StructuralAsset Class   See Also |

Sets the shear modulus of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetShearModulus( 	double shearModulus ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetShearModulus ( _ 	shearModulus As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetShearModulus( 	double shearModulus ) ``` |

#### Parameters

shearModulus
:   Type:  System Double

# Remarks

The shear modulus is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value. The value is in Newtons per foot meter (N/(ft Â· m)).

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace